// // 7. Напишите программу, которая принимает на вход трехзначное число
// и на выходе показывает последнюю цифру этого числа 
// 456 -> 6
// 782 -> 2
// 918 -> 8

//Console.Write("Введите целое число ");
//int nun = Convert.ToInt32(Console.ReadLine());
//int nun2 = - nun;
//while (nun2 <= nun)
//{
//Console.Write(nun2+" ");
//nun2++;
//}
//Console.WriteLine();

// Console.Write("Введите целое число ");
// int a = Convert.ToInt32(Console.ReadLine());
// Console.Write("Ввод чисел от N до N ");
// for(int i = -a; i <=a; i++)
// {
//     Console.Write(i + " ");
// 

// Console.WriteLine("Введите целое число");
// int nun = Convert.ToInt32(Console.ReadLine());
// int nun2 = - nun;
// while(nun2 <= nun)
// {
//     Console.Write(nun2+ " ");
//     nun2++;
//  }

// Console.WriteLine("Введите целое число");
// int a = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("Вывыод чисел от N до N");
// for(int i = -a; i <= a; i++)
// {
//     Console.Write(i + " ");
// }

// Console.WriteLine("Введите целое число");
// int nun = Convert.ToInt32(Console.ReadLine());
// int nun2 = - nun;
// while(nun2 <= nun)
// {
//     Console.Write(nun2+ " " );
//     nun2++;
// }
