// Задачо 0
// Напишите программу, которая
// 1. на вход принимает число
// 2. и выдает его квадрат (число
// умноженное на само себя).
// Например: 4->16, -3->9 -7->49

// Задача 1.
// Напишите программу
// 1. которая на вход принимает два числа
// 2.и проверяет, является ли первое число квадратом второго..
// // a = 25, b = 5 - > да, // a = 2; b = 10 - > нет
// // a = 9; b = - 3 - > да, // a = -3; b = 9 - > нет

// Задача 3.
// // Напишите программу, которая будет выдавать
// // название дня недели по заданному номеру.
// // 3 -> Среда
// // 5 - > Пятница

// Задача 5. Напишите программу, которая на вход принимеает 
// одно число (N), а на выходе показывает все целые числа 
// в промежутке от -N до N.
// 4 - > -4,-3,-2,-1, 0,1,2,3,4

// Первый вариант


// Второй варивнт